var areaJson = [
    {
        "id": "14010200",
        "name": "东城区",
        "group": null
    },
    {
        "id": "10000100",
        "name": "黄浦区",
        "group": null
    },
    {
        "id": "10000200",
        "name": "卢湾区",
        "group": null
    },
    {
        "id": "14010100",
        "name": "莞城区",
        "group": null
    },
    {
        "id": "32190000",
        "name": "阿坝",
        "group": "A-D"
    },
    {
        "id": "24000000",
        "name": "安徽",
        "group": "A-G"
    },
    {
        "id": "23100000",
        "name": "安康",
        "group": "A-D"
    },
    {
        "id": "38040000",
        "name": "阿克苏",
        "group": "A-D"
    },
    {
        "id": "39060000",
        "name": "阿里",
        "group": "A-D"
    },
    {
        "id": "30100000",
        "name": "阿拉善",
        "group": "A-D"
    },
    {
        "id": "42000000",
        "name": "澳门",
        "group": "A-G"
    },
    {
        "id": "24160000",
        "name": "安庆",
        "group": "A-D"
    },
    {
        "id": "33050000",
        "name": "安顺",
        "group": "A-D"
    },
    {
        "id": "21100000",
        "name": "鞍山",
        "group": "A-D"
    },
    {
        "id": "19100000",
        "name": "安阳",
        "group": "A-D"
    },
    {
        "id": "24040000",
        "name": "蚌埠",
        "group": "A-D"
    },
    {
        "id": "22050000",
        "name": "白城",
        "group": "A-D"
    },
    {
        "id": "18030000",
        "name": "保定",
        "group": "A-D"
    },
    {
        "id": "31030000",
        "name": "北海",
        "group": "A-D"
    },
    {
        "id": "33060000",
        "name": "毕节",
        "group": "A-D"
    },
    {
        "id": "11000000",
        "name": "北京",
        "group": "A-G"
    },
    {
        "id": "23030000",
        "name": "宝鸡",
        "group": "A-D"
    },
    {
        "id": "22080000",
        "name": "白山",
        "group": "A-D"
    },
    {
        "id": "31060000",
        "name": "百色",
        "group": "A-D"
    },
    {
        "id": "34090000",
        "name": "保山",
        "group": "A-D"
    },
    {
        "id": "30030000",
        "name": "包头",
        "group": "A-D"
    },
    {
        "id": "38110000",
        "name": "博爾塔拉",
        "group": "A-D"
    },
    {
        "id": "21050000",
        "name": "本溪",
        "group": "A-D"
    },
    {
        "id": "35080000",
        "name": "白银",
        "group": "A-D"
    },
    {
        "id": "38090000",
        "name": "巴音郭楞",
        "group": "A-D"
    },
    {
        "id": "30120000",
        "name": "巴彦淖尔",
        "group": "A-D"
    },
    {
        "id": "32150000",
        "name": "巴中",
        "group": "A-D"
    },
    {
        "id": "25130000",
        "name": "滨州",
        "group": "A-D"
    },
    {
        "id": "24080000",
        "name": "亳州",
        "group": "A-D"
    },
    {
        "id": "22010000",
        "name": "长春",
        "group": "A-D"
    },
    {
        "id": "28080000",
        "name": "常德",
        "group": "A-D"
    },
    {
        "id": "32010000",
        "name": "成都",
        "group": "A-D"
    },
    {
        "id": "39030000",
        "name": "昌都",
        "group": "A-D"
    },
    {
        "id": "18110000",
        "name": "承德",
        "group": "A-D"
    },
    {
        "id": "30020000",
        "name": "赤峰",
        "group": "A-D"
    },
    {
        "id": "24090000",
        "name": "巢湖",
        "group": "A-D"
    },
    {
        "id": "38100000",
        "name": "昌吉",
        "group": "A-D"
    },
    {
        "id": "13000000",
        "name": "重庆",
        "group": "A-G"
    },
    {
        "id": "28010000",
        "name": "长沙",
        "group": "A-D"
    },
    {
        "id": "34060000",
        "name": "楚雄",
        "group": "A-D"
    },
    {
        "id": "21120000",
        "name": "朝阳",
        "group": "A-D"
    },
    {
        "id": "18100000",
        "name": "沧州",
        "group": "A-D"
    },
    {
        "id": "16050000",
        "name": "常州",
        "group": "A-D"
    },
    {
        "id": "28070000",
        "name": "郴州",
        "group": "A-D"
    },
    {
        "id": "31090000",
        "name": "崇左",
        "group": "A-D"
    },
    {
        "id": "24140000",
        "name": "滁州",
        "group": "A-D"
    },
    {
        "id": "26060000",
        "name": "长治",
        "group": "A-D"
    },
    {
        "id": "24170000",
        "name": "池州",
        "group": "A-D"
    },
    {
        "id": "14140000",
        "name": "潮州",
        "group": "A-D"
    },
    {
        "id": "21110000",
        "name": "丹东",
        "group": "A-D"
    },
    {
        "id": "14010000",
        "name": "东莞",
        "group": "A-D"
    },
    {
        "id": "34130000",
        "name": "德宏",
        "group": "A-D"
    },
    {
        "id": "34030000",
        "name": "大理",
        "group": "A-D"
    },
    {
        "id": "21040000",
        "name": "大连",
        "group": "A-D"
    },
    {
        "id": "34070000",
        "name": "迪庆",
        "group": "A-D"
    },
    {
        "id": "20040000",
        "name": "大庆",
        "group": "A-D"
    },
    {
        "id": "26020000",
        "name": "大同",
        "group": "A-D"
    },
    {
        "id": "35120000",
        "name": "定西",
        "group": "A-D"
    },
    {
        "id": "20130000",
        "name": "大兴安岭",
        "group": "A-D"
    },
    {
        "id": "25160000",
        "name": "东营",
        "group": "A-D"
    },
    {
        "id": "32060000",
        "name": "德阳",
        "group": "A-D"
    },
    {
        "id": "47000000",
        "name": "钓鱼岛",
        "group": "A-G"
    },
    {
        "id": "25120000",
        "name": "德州",
        "group": "A-D"
    },
    {
        "id": "32160000",
        "name": "达州",
        "group": "A-D"
    },
    {
        "id": "30060000",
        "name": "鄂尔多斯",
        "group": "E-H"
    },
    {
        "id": "27130000",
        "name": "恩施",
        "group": "E-H"
    },
    {
        "id": "27080000",
        "name": "鄂州",
        "group": "E-H"
    },
    {
        "id": "31080000",
        "name": "防城港",
        "group": "E-H"
    },
    {
        "id": "17000000",
        "name": "福建",
        "group": "A-G"
    },
    {
        "id": "21030000",
        "name": "抚顺",
        "group": "E-H"
    },
    {
        "id": "14090000",
        "name": "佛山",
        "group": "E-H"
    },
    {
        "id": "21130000",
        "name": "阜新",
        "group": "E-H"
    },
    {
        "id": "24120000",
        "name": "阜阳",
        "group": "E-H"
    },
    {
        "id": "29100000",
        "name": "抚州",
        "group": "E-H"
    },
    {
        "id": "17010000",
        "name": "福州",
        "group": "E-H"
    },
    {
        "id": "32140000",
        "name": "广安",
        "group": "E-H"
    },
    {
        "id": "14000000",
        "name": "广东",
        "group": "A-G"
    },
    {
        "id": "31120000",
        "name": "贵港",
        "group": "E-H"
    },
    {
        "id": "36080000",
        "name": "果洛",
        "group": "E-H"
    },
    {
        "id": "31020000",
        "name": "桂林",
        "group": "E-H"
    },
    {
        "id": "35140000",
        "name": "甘南",
        "group": "E-H"
    },
    {
        "id": "35000000",
        "name": "甘肃",
        "group": "A-G"
    },
    {
        "id": "44000000",
        "name": "国外",
        "group": "A-G"
    },
    {
        "id": "31000000",
        "name": "广西",
        "group": "A-G"
    },
    {
        "id": "32110000",
        "name": "广元",
        "group": "E-H"
    },
    {
        "id": "37040000",
        "name": "固原",
        "group": "E-H"
    },
    {
        "id": "33010000",
        "name": "贵阳",
        "group": "E-H"
    },
    {
        "id": "14030000",
        "name": "广州",
        "group": "E-H"
    },
    {
        "id": "32200000",
        "name": "甘孜",
        "group": "E-H"
    },
    {
        "id": "29080000",
        "name": "赣州",
        "group": "E-H"
    },
    {
        "id": "33000000",
        "name": "贵州",
        "group": "A-G"
    },
    {
        "id": "16130000",
        "name": "淮安",
        "group": "E-H"
    },
    {
        "id": "24060000",
        "name": "淮北",
        "group": "E-H"
    },
    {
        "id": "19040000",
        "name": "鹤壁",
        "group": "E-H"
    },
    {
        "id": "36050000",
        "name": "海北",
        "group": "E-H"
    },
    {
        "id": "27000000",
        "name": "湖北",
        "group": "H-K"
    },
    {
        "id": "18000000",
        "name": "河北",
        "group": "H-K"
    },
    {
        "id": "31070000",
        "name": "河池",
        "group": "E-H"
    },
    {
        "id": "18020000",
        "name": "邯郸",
        "group": "E-H"
    },
    {
        "id": "36020000",
        "name": "海东",
        "group": "E-H"
    },
    {
        "id": "20010000",
        "name": "哈尔滨",
        "group": "E-H"
    },
    {
        "id": "24010000",
        "name": "合肥",
        "group": "E-H"
    },
    {
        "id": "20080000",
        "name": "鹤岗",
        "group": "E-H"
    },
    {
        "id": "27090000",
        "name": "黄冈",
        "group": "E-H"
    },
    {
        "id": "20120000",
        "name": "黑河",
        "group": "E-H"
    },
    {
        "id": "28100000",
        "name": "怀化",
        "group": "E-H"
    },
    {
        "id": "34150000",
        "name": "红河",
        "group": "E-H"
    },
    {
        "id": "30010000",
        "name": "呼和浩特",
        "group": "E-H"
    },
    {
        "id": "40010000",
        "name": "海口",
        "group": "E-H"
    },
    {
        "id": "30070000",
        "name": "呼伦贝尔",
        "group": "E-H"
    },
    {
        "id": "21140000",
        "name": "葫芦岛",
        "group": "E-H"
    },
    {
        "id": "20000000",
        "name": "黑龙江",
        "group": "H-K"
    },
    {
        "id": "38030000",
        "name": "哈密",
        "group": "E-H"
    },
    {
        "id": "36030000",
        "name": "海南",
        "group": "E-H"
    },
    {
        "id": "28000000",
        "name": "湖南",
        "group": "H-K"
    },
    {
        "id": "19000000",
        "name": "河南",
        "group": "H-K"
    },
    {
        "id": "24070000",
        "name": "淮南",
        "group": "E-H"
    },
    {
        "id": "36060000",
        "name": "黄南",
        "group": "E-H"
    },
    {
        "id": "40000000",
        "name": "海南",
        "group": "H-K"
    },
    {
        "id": "24100000",
        "name": "黄山",
        "group": "E-H"
    },
    {
        "id": "18090000",
        "name": "衡水",
        "group": "E-H"
    },
    {
        "id": "27070000",
        "name": "黄石",
        "group": "E-H"
    },
    {
        "id": "38070000",
        "name": "和田",
        "group": "E-H"
    },
    {
        "id": "36040000",
        "name": "海西",
        "group": "E-H"
    },
    {
        "id": "14190000",
        "name": "河源",
        "group": "E-H"
    },
    {
        "id": "28060000",
        "name": "衡阳",
        "group": "E-H"
    },
    {
        "id": "31140000",
        "name": "贺州",
        "group": "E-H"
    },
    {
        "id": "15060000",
        "name": "湖州",
        "group": "E-H"
    },
    {
        "id": "23070000",
        "name": "汉中",
        "group": "E-H"
    },
    {
        "id": "25090000",
        "name": "荷泽",
        "group": "E-H"
    },
    {
        "id": "15010000",
        "name": "杭州",
        "group": "E-H"
    },
    {
        "id": "14070000",
        "name": "惠州",
        "group": "E-H"
    },
    {
        "id": "29090000",
        "name": "吉安",
        "group": "I-L"
    },
    {
        "id": "26080000",
        "name": "晋城",
        "group": "I-L"
    },
    {
        "id": "35060000",
        "name": "金昌",
        "group": "I-L"
    },
    {
        "id": "29020000",
        "name": "景德镇",
        "group": "I-L"
    },
    {
        "id": "15040000",
        "name": "金华",
        "group": "I-L"
    },
    {
        "id": "29030000",
        "name": "九江",
        "group": "I-L"
    },
    {
        "id": "22060000",
        "name": "吉林",
        "group": "I-L"
    },
    {
        "id": "22000000",
        "name": "吉林",
        "group": "H-K"
    },
    {
        "id": "27060000",
        "name": "荆门",
        "group": "I-L"
    },
    {
        "id": "14080000",
        "name": "江门",
        "group": "I-L"
    },
    {
        "id": "20020000",
        "name": "佳木斯",
        "group": "I-L"
    },
    {
        "id": "25080000",
        "name": "济宁",
        "group": "I-L"
    },
    {
        "id": "25010000",
        "name": "济南",
        "group": "I-L"
    },
    {
        "id": "35020000",
        "name": "酒泉",
        "group": "I-L"
    },
    {
        "id": "16000000",
        "name": "江苏",
        "group": "H-K"
    },
    {
        "id": "20110000",
        "name": "鸡西",
        "group": "I-L"
    },
    {
        "id": "15070000",
        "name": "嘉兴",
        "group": "I-L"
    },
    {
        "id": "29000000",
        "name": "江西",
        "group": "H-K"
    },
    {
        "id": "14210000",
        "name": "揭阳",
        "group": "I-L"
    },
    {
        "id": "35050000",
        "name": "嘉峪关",
        "group": "I-L"
    },
    {
        "id": "26100000",
        "name": "晋中",
        "group": "I-L"
    },
    {
        "id": "27040000",
        "name": "荆州",
        "group": "I-L"
    },
    {
        "id": "19050000",
        "name": "焦作",
        "group": "I-L"
    },
    {
        "id": "21070000",
        "name": "锦州",
        "group": "I-L"
    },
    {
        "id": "19030000",
        "name": "开封",
        "group": "I-L"
    },
    {
        "id": "38020000",
        "name": "克拉玛依",
        "group": "I-L"
    },
    {
        "id": "34010000",
        "name": "昆明",
        "group": "I-L"
    },
    {
        "id": "38060000",
        "name": "喀什",
        "group": "I-L"
    },
    {
        "id": "38080000",
        "name": "克孜勒蘇",
        "group": "I-L"
    },
    {
        "id": "24130000",
        "name": "六安",
        "group": "I-L"
    },
    {
        "id": "31130000",
        "name": "来宾",
        "group": "I-L"
    },
    {
        "id": "34120000",
        "name": "临沧",
        "group": "I-L"
    },
    {
        "id": "25110000",
        "name": "聊城",
        "group": "I-L"
    },
    {
        "id": "28090000",
        "name": "娄底",
        "group": "I-L"
    },
    {
        "id": "18080000",
        "name": "廊坊",
        "group": "I-L"
    },
    {
        "id": "26040000",
        "name": "临汾",
        "group": "I-L"
    },
    {
        "id": "19120000",
        "name": "漯河",
        "group": "I-L"
    },
    {
        "id": "34050000",
        "name": "丽江",
        "group": "I-L"
    },
    {
        "id": "26110000",
        "name": "吕梁",
        "group": "I-L"
    },
    {
        "id": "35130000",
        "name": "陇南",
        "group": "I-L"
    },
    {
        "id": "21000000",
        "name": "辽宁",
        "group": "L-S"
    },
    {
        "id": "33040000",
        "name": "六盘水",
        "group": "I-L"
    },
    {
        "id": "32210000",
        "name": "凉山",
        "group": "I-L"
    },
    {
        "id": "39010000",
        "name": "拉萨",
        "group": "I-L"
    },
    {
        "id": "15090000",
        "name": "丽水",
        "group": "I-L"
    },
    {
        "id": "32130000",
        "name": "乐山",
        "group": "I-L"
    },
    {
        "id": "25070000",
        "name": "莱芜",
        "group": "I-L"
    },
    {
        "id": "35030000",
        "name": "临夏",
        "group": "I-L"
    },
    {
        "id": "21090000",
        "name": "辽阳",
        "group": "I-L"
    },
    {
        "id": "22040000",
        "name": "辽源",
        "group": "I-L"
    },
    {
        "id": "19020000",
        "name": "洛阳",
        "group": "I-L"
    },
    {
        "id": "17080000",
        "name": "龙岩",
        "group": "I-L"
    },
    {
        "id": "25060000",
        "name": "临沂",
        "group": "I-L"
    },
    {
        "id": "16080000",
        "name": "连云港",
        "group": "I-L"
    },
    {
        "id": "32030000",
        "name": "泸州",
        "group": "I-L"
    },
    {
        "id": "35010000",
        "name": "兰州",
        "group": "I-L"
    },
    {
        "id": "31040000",
        "name": "柳州",
        "group": "I-L"
    },
    {
        "id": "39070000",
        "name": "林芝",
        "group": "I-L"
    },
    {
        "id": "24030000",
        "name": "马鞍山",
        "group": "M-P"
    },
    {
        "id": "20030000",
        "name": "牡丹江",
        "group": "M-P"
    },
    {
        "id": "14160000",
        "name": "茂名",
        "group": "M-P"
    },
    {
        "id": "32180000",
        "name": "眉山",
        "group": "M-P"
    },
    {
        "id": "32100000",
        "name": "绵阳",
        "group": "M-P"
    },
    {
        "id": "14170000",
        "name": "梅州",
        "group": "M-P"
    },
    {
        "id": "15020000",
        "name": "宁波",
        "group": "M-P"
    },
    {
        "id": "29010000",
        "name": "南昌",
        "group": "M-P"
    },
    {
        "id": "32090000",
        "name": "南充",
        "group": "M-P"
    },
    {
        "id": "17090000",
        "name": "宁德",
        "group": "M-P"
    },
    {
        "id": "16010000",
        "name": "南京",
        "group": "M-P"
    },
    {
        "id": "34140000",
        "name": "怒江",
        "group": "M-P"
    },
    {
        "id": "32040000",
        "name": "内江",
        "group": "M-P"
    },
    {
        "id": "30000000",
        "name": "内蒙古",
        "group": "L-S"
    },
    {
        "id": "31010000",
        "name": "南宁",
        "group": "M-P"
    },
    {
        "id": "17060000",
        "name": "南平",
        "group": "M-P"
    },
    {
        "id": "39020000",
        "name": "那曲",
        "group": "M-P"
    },
    {
        "id": "16070000",
        "name": "南通",
        "group": "M-P"
    },
    {
        "id": "37000000",
        "name": "宁夏",
        "group": "L-S"
    },
    {
        "id": "19160000",
        "name": "南阳",
        "group": "M-P"
    },
    {
        "id": "23110000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "38130000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "19180000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "25180000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "28150000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "34170000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "30130000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "32220000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "14220000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "20140000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "37050000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "24180000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "22100000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "31150000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "29120000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "36090000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "21150000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "15120000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "35150000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "16140000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "27170000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "26120000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "33100000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "40030000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "18120000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "39080000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "45000000",
        "name": "其他",
        "group": "L-S"
    },
    {
        "id": "17100000",
        "name": "其他",
        "group": "M-P"
    },
    {
        "id": "19140000",
        "name": "平顶山",
        "group": "M-P"
    },
    {
        "id": "21080000",
        "name": "盘锦",
        "group": "M-P"
    },
    {
        "id": "35070000",
        "name": "平凉",
        "group": "M-P"
    },
    {
        "id": "17070000",
        "name": "莆田",
        "group": "M-P"
    },
    {
        "id": "29070000",
        "name": "萍乡",
        "group": "M-P"
    },
    {
        "id": "19110000",
        "name": "濮阳",
        "group": "M-P"
    },
    {
        "id": "32050000",
        "name": "攀枝花",
        "group": "M-P"
    },
    {
        "id": "33080000",
        "name": "黔东南",
        "group": "Q-T"
    },
    {
        "id": "25020000",
        "name": "青岛",
        "group": "Q-T"
    },
    {
        "id": "36000000",
        "name": "青海",
        "group": "L-S"
    },
    {
        "id": "18050000",
        "name": "秦皇岛",
        "group": "Q-T"
    },
    {
        "id": "27140000",
        "name": "潜江",
        "group": "Q-T"
    },
    {
        "id": "34020000",
        "name": "曲靖",
        "group": "Q-T"
    },
    {
        "id": "33090000",
        "name": "黔南",
        "group": "Q-T"
    },
    {
        "id": "20050000",
        "name": "齐齐哈尔",
        "group": "Q-T"
    },
    {
        "id": "20090000",
        "name": "七台河",
        "group": "Q-T"
    },
    {
        "id": "33070000",
        "name": "黔西南",
        "group": "Q-T"
    },
    {
        "id": "35110000",
        "name": "庆阳",
        "group": "Q-T"
    },
    {
        "id": "14110000",
        "name": "清远",
        "group": "Q-T"
    },
    {
        "id": "15080000",
        "name": "衢州",
        "group": "Q-T"
    },
    {
        "id": "17030000",
        "name": "泉州",
        "group": "Q-T"
    },
    {
        "id": "31100000",
        "name": "钦州",
        "group": "Q-T"
    },
    {
        "id": "39050000",
        "name": "日喀则",
        "group": "Q-T"
    },
    {
        "id": "25100000",
        "name": "日照",
        "group": "Q-T"
    },
    {
        "id": "32000000",
        "name": "四川",
        "group": "L-S"
    },
    {
        "id": "14230000",
        "name": "顺德",
        "group": "Q-T"
    },
    {
        "id": "25000000",
        "name": "山东",
        "group": "L-S"
    },
    {
        "id": "14120000",
        "name": "韶关",
        "group": "Q-T"
    },
    {
        "id": "20060000",
        "name": "绥化",
        "group": "Q-T"
    },
    {
        "id": "10000000",
        "name": "上海",
        "group": "L-S"
    },
    {
        "id": "18010000",
        "name": "石家庄",
        "group": "Q-T"
    },
    {
        "id": "23090000",
        "name": "商洛",
        "group": "Q-T"
    },
    {
        "id": "17050000",
        "name": "三明",
        "group": "Q-T"
    },
    {
        "id": "34110000",
        "name": "思茅",
        "group": "Q-T"
    },
    {
        "id": "19150000",
        "name": "三门峡",
        "group": "Q-T"
    },
    {
        "id": "32080000",
        "name": "遂宁",
        "group": "Q-T"
    },
    {
        "id": "39040000",
        "name": "山南",
        "group": "Q-T"
    },
    {
        "id": "22030000",
        "name": "四平",
        "group": "Q-T"
    },
    {
        "id": "19170000",
        "name": "商丘",
        "group": "Q-T"
    },
    {
        "id": "16100000",
        "name": "宿迁",
        "group": "Q-T"
    },
    {
        "id": "29110000",
        "name": "上饶",
        "group": "Q-T"
    },
    {
        "id": "46000000",
        "name": "三沙",
        "group": "L-S"
    },
    {
        "id": "14060000",
        "name": "汕头",
        "group": "Q-T"
    },
    {
        "id": "14180000",
        "name": "汕尾",
        "group": "Q-T"
    },
    {
        "id": "26000000",
        "name": "山西",
        "group": "L-S"
    },
    {
        "id": "15050000",
        "name": "绍兴",
        "group": "Q-T"
    },
    {
        "id": "23000000",
        "name": "陕西",
        "group": "L-S"
    },
    {
        "id": "21010000",
        "name": "沈阳",
        "group": "Q-T"
    },
    {
        "id": "28120000",
        "name": "邵阳",
        "group": "Q-T"
    },
    {
        "id": "22070000",
        "name": "松原",
        "group": "Q-T"
    },
    {
        "id": "27110000",
        "name": "十堰",
        "group": "Q-T"
    },
    {
        "id": "40020000",
        "name": "三亚",
        "group": "Q-T"
    },
    {
        "id": "20100000",
        "name": "双鸭山",
        "group": "Q-T"
    },
    {
        "id": "14020000",
        "name": "深圳",
        "group": "Q-T"
    },
    {
        "id": "27120000",
        "name": "随州",
        "group": "Q-T"
    },
    {
        "id": "26090000",
        "name": "朔州",
        "group": "Q-T"
    },
    {
        "id": "24110000",
        "name": "宿州",
        "group": "Q-T"
    },
    {
        "id": "16020000",
        "name": "苏州",
        "group": "Q-T"
    },
    {
        "id": "37030000",
        "name": "石嘴山",
        "group": "Q-T"
    },
    {
        "id": "25150000",
        "name": "泰安",
        "group": "Q-T"
    },
    {
        "id": "23040000",
        "name": "铜川",
        "group": "Q-T"
    },
    {
        "id": "22020000",
        "name": "通化",
        "group": "Q-T"
    },
    {
        "id": "12000000",
        "name": "天津",
        "group": "T-Z"
    },
    {
        "id": "24050000",
        "name": "铜陵",
        "group": "Q-T"
    },
    {
        "id": "21020000",
        "name": "铁岭",
        "group": "Q-T"
    },
    {
        "id": "30050000",
        "name": "通辽",
        "group": "Q-T"
    },
    {
        "id": "38050000",
        "name": "吐鲁番",
        "group": "Q-T"
    },
    {
        "id": "27150000",
        "name": "天门",
        "group": "Q-T"
    },
    {
        "id": "33030000",
        "name": "铜仁",
        "group": "Q-T"
    },
    {
        "id": "35100000",
        "name": "天水",
        "group": "Q-T"
    },
    {
        "id": "18070000",
        "name": "唐山",
        "group": "Q-T"
    },
    {
        "id": "43000000",
        "name": "台湾",
        "group": "T-Z"
    },
    {
        "id": "26010000",
        "name": "太原",
        "group": "Q-T"
    },
    {
        "id": "15100000",
        "name": "台州",
        "group": "Q-T"
    },
    {
        "id": "16110000",
        "name": "泰州",
        "group": "Q-T"
    },
    {
        "id": "25050000",
        "name": "潍坊",
        "group": "U-X"
    },
    {
        "id": "24020000",
        "name": "芜湖",
        "group": "U-X"
    },
    {
        "id": "30040000",
        "name": "乌海",
        "group": "U-X"
    },
    {
        "id": "27010000",
        "name": "武汉",
        "group": "U-X"
    },
    {
        "id": "25140000",
        "name": "威海",
        "group": "U-X"
    },
    {
        "id": "30080000",
        "name": "乌兰察布",
        "group": "U-X"
    },
    {
        "id": "38010000",
        "name": "乌鲁木齐",
        "group": "U-X"
    },
    {
        "id": "23050000",
        "name": "渭南",
        "group": "U-X"
    },
    {
        "id": "34100000",
        "name": "文山",
        "group": "U-X"
    },
    {
        "id": "35090000",
        "name": "武威",
        "group": "U-X"
    },
    {
        "id": "16030000",
        "name": "无锡",
        "group": "U-X"
    },
    {
        "id": "31110000",
        "name": "梧州",
        "group": "U-X"
    },
    {
        "id": "37020000",
        "name": "吴忠",
        "group": "U-X"
    },
    {
        "id": "15030000",
        "name": "温州",
        "group": "U-X"
    },
    {
        "id": "23010000",
        "name": "西安",
        "group": "U-X"
    },
    {
        "id": "30110000",
        "name": "兴安",
        "group": "U-X"
    },
    {
        "id": "24150000",
        "name": "宣城",
        "group": "U-X"
    },
    {
        "id": "19060000",
        "name": "许昌",
        "group": "U-X"
    },
    {
        "id": "39000000",
        "name": "西藏",
        "group": "T-Z"
    },
    {
        "id": "27050000",
        "name": "襄樊",
        "group": "U-X"
    },
    {
        "id": "27030000",
        "name": "孝感",
        "group": "U-X"
    },
    {
        "id": "41000000",
        "name": "香港",
        "group": "T-Z"
    },
    {
        "id": "38000000",
        "name": "新疆",
        "group": "T-Z"
    },
    {
        "id": "30090000",
        "name": "锡林郭勒",
        "group": "U-X"
    },
    {
        "id": "17020000",
        "name": "厦门",
        "group": "U-X"
    },
    {
        "id": "27100000",
        "name": "咸宁",
        "group": "U-X"
    },
    {
        "id": "36010000",
        "name": "西宁",
        "group": "U-X"
    },
    {
        "id": "34160000",
        "name": "西双版纳",
        "group": "U-X"
    },
    {
        "id": "27160000",
        "name": "仙桃",
        "group": "U-X"
    },
    {
        "id": "18060000",
        "name": "邢台",
        "group": "U-X"
    },
    {
        "id": "28020000",
        "name": "湘潭",
        "group": "U-X"
    },
    {
        "id": "28140000",
        "name": "湘西",
        "group": "U-X"
    },
    {
        "id": "19090000",
        "name": "新乡",
        "group": "U-X"
    },
    {
        "id": "23020000",
        "name": "咸阳",
        "group": "U-X"
    },
    {
        "id": "19130000",
        "name": "信阳",
        "group": "U-X"
    },
    {
        "id": "29060000",
        "name": "新余",
        "group": "U-X"
    },
    {
        "id": "16090000",
        "name": "徐州",
        "group": "U-X"
    },
    {
        "id": "26030000",
        "name": "忻州",
        "group": "U-X"
    },
    {
        "id": "23060000",
        "name": "延安",
        "group": "Y-Z"
    },
    {
        "id": "32070000",
        "name": "雅安",
        "group": "Y-Z"
    },
    {
        "id": "32020000",
        "name": "宜宾",
        "group": "Y-Z"
    },
    {
        "id": "22090000",
        "name": "延边",
        "group": "Y-Z"
    },
    {
        "id": "29050000",
        "name": "宜春",
        "group": "Y-Z"
    },
    {
        "id": "26050000",
        "name": "运城",
        "group": "Y-Z"
    },
    {
        "id": "20070000",
        "name": "伊春",
        "group": "Y-Z"
    },
    {
        "id": "16120000",
        "name": "盐城",
        "group": "Y-Z"
    },
    {
        "id": "37010000",
        "name": "银川",
        "group": "Y-Z"
    },
    {
        "id": "27020000",
        "name": "宜昌",
        "group": "Y-Z"
    },
    {
        "id": "14200000",
        "name": "云浮",
        "group": "Y-Z"
    },
    {
        "id": "14100000",
        "name": "阳江",
        "group": "Y-Z"
    },
    {
        "id": "21060000",
        "name": "营口",
        "group": "Y-Z"
    },
    {
        "id": "38120000",
        "name": "伊犁",
        "group": "Y-Z"
    },
    {
        "id": "23080000",
        "name": "榆林",
        "group": "Y-Z"
    },
    {
        "id": "31050000",
        "name": "玉林",
        "group": "Y-Z"
    },
    {
        "id": "34000000",
        "name": "云南",
        "group": "T-Z"
    },
    {
        "id": "26070000",
        "name": "阳泉",
        "group": "Y-Z"
    },
    {
        "id": "36070000",
        "name": "玉树",
        "group": "Y-Z"
    },
    {
        "id": "25030000",
        "name": "烟台",
        "group": "Y-Z"
    },
    {
        "id": "29040000",
        "name": "鹰潭",
        "group": "Y-Z"
    },
    {
        "id": "34040000",
        "name": "玉溪",
        "group": "Y-Z"
    },
    {
        "id": "28110000",
        "name": "益阳",
        "group": "Y-Z"
    },
    {
        "id": "28030000",
        "name": "岳阳",
        "group": "Y-Z"
    },
    {
        "id": "28130000",
        "name": "永州",
        "group": "Y-Z"
    },
    {
        "id": "16040000",
        "name": "扬州",
        "group": "Y-Z"
    },
    {
        "id": "25040000",
        "name": "淄博",
        "group": "Y-Z"
    },
    {
        "id": "32120000",
        "name": "自贡",
        "group": "Y-Z"
    },
    {
        "id": "14050000",
        "name": "珠海",
        "group": "Y-Z"
    },
    {
        "id": "14150000",
        "name": "湛江",
        "group": "Y-Z"
    },
    {
        "id": "15000000",
        "name": "浙江",
        "group": "T-Z"
    },
    {
        "id": "16060000",
        "name": "镇江",
        "group": "Y-Z"
    },
    {
        "id": "28050000",
        "name": "张家界",
        "group": "Y-Z"
    },
    {
        "id": "18040000",
        "name": "张家口",
        "group": "Y-Z"
    },
    {
        "id": "19080000",
        "name": "周口",
        "group": "Y-Z"
    },
    {
        "id": "19070000",
        "name": "驻马店",
        "group": "Y-Z"
    },
    {
        "id": "14130000",
        "name": "肇庆",
        "group": "Y-Z"
    },
    {
        "id": "14040000",
        "name": "中山",
        "group": "Y-Z"
    },
    {
        "id": "15110000",
        "name": "舟山",
        "group": "Y-Z"
    },
    {
        "id": "34080000",
        "name": "昭通",
        "group": "Y-Z"
    },
    {
        "id": "35040000",
        "name": "张掖",
        "group": "Y-Z"
    },
    {
        "id": "33020000",
        "name": "遵义",
        "group": "Y-Z"
    },
    {
        "id": "32170000",
        "name": "资阳",
        "group": "Y-Z"
    },
    {
        "id": "19010000",
        "name": "郑州",
        "group": "Y-Z"
    },
    {
        "id": "17040000",
        "name": "漳州",
        "group": "Y-Z"
    },
    {
        "id": "28040000",
        "name": "株洲",
        "group": "Y-Z"
    },
    {
        "id": "25170000",
        "name": "枣庄",
        "group": "Y-Z"
    }
]